{"Learn SudoLang": {"prefix": "sudo example learn sudolang", "body": "SudoLang can be used to produce AI-first programs such as chatbots and text-based productivity applications, or to produce traditional code in any language using AI Driven Development and the `transpile` function.\n\nSudoLang is designed to be understood by LLMs without any special prompting. An AI model does not need the SudoLang specification to correctly interpret SudoLang programs.\n\n## Why?\n\nSave 20% - 30% tokens over natural language prompts, with more predictable output, conforming to data structures you supply.\n\nAuthor traditional code in SudoLang and transpile to any language for 10x - 20x productivity by having the language model automatically build functions, algorithms, unit tests, etc.\n\nMain features:\n\n* Markdown - freely mix documentation and code.\n* Interfaces encapsulate related state, constraints, `/commands`, and functions.\n* Declarative, natural language constraints.\n* /commands that can be inferred automatically.\n* Pipe operator `|>` for function composition.\n* Most operators you use in any popular programming language. (Exception: use `^` for exponentiation instead of `**`. Use `xor` for XOR).\n* Pattern matching with inferred patterns and destructuring.\n* Function modifiers to customize function behaviors, inference style, length, output format, etc. e.g. `list(5 pizza toppings):format=yaml`\n* Loops and block scopes.\n* Transpile to any language.\n\n## Constraint based programming in SudoLang\n\nSimple natural language constraints can represent complex behaviors with little human readable definitions, requirements, and rules.\n\n```\nfunction longestIncreasingSubsequence() {\n  A subsequence is derived from the original sequence by selectively omitting elements without changing the order.\n}\n```\n\nThis also works for math axioms:\n\n```\nfunction pythagoreanTipple() {\n  if not supplied, generate random seeds\n  a^2 + b^2 = c^2\n  return [a, b, c]\n}\n```\n\n## Interfaces\n\nDefine interfaces with the optional interface keyword, or omit it:\n\n```\nFoo {\n  bar // undefined\n  baz: \"Default value\"\n\n  Constraints {\n    // list constraints in natural language\n    // can be used to dynamically synchronize state, emit events, etc\n    when baz changes, increment bar and emit({ changed: baz, oldValue, newValue })\n  }\n  log() {\n    { bar, baz } as json\n  }\n}\n```\n\nBecause it's an LLM, many functions can be automagically inferred. Just call a function with a descriptive name without defining it, and it will usually work.\n\n---\n\n# SudoLang in a Nutshell\n\nRoleplay as a tutor teaching SudoLang, following the instructions below:\n\n```\nConstraintExample1 {\n  /*\n  Requirements are a special kind of constraint that throw errors when the user tries to perform an invalid action. Requirements are constraints on inputs.\n\n  Imagine you're building a scheduling app for a conference. You have 4 stages. You need to ensure that you don't book more than 4 speakers in the same timeslot. Here's how you might do that:\n    */\n  State {\n      Stages [1,2,3,4]\n  }\n  Constraints {\n        Require the number of overlapping speaker timeslots to be less than the number of available stages.\n    }\n}\n\nChatbotConstraintExample {\n  /* Output constraints tell the AI how to constrain its output, rather than constraining user inputs. For example, if you want a chatbot to use a young adult vocabulary: */\n  Constraints {\n    Avoid mentioning constraints.\n    Vocabulary: Young adult\n    Tone: Playful.\n     Use emojis when it's fun.\n    Use *emotes* for fun.\n  }\n}\n\nScoreboard {\n  /* Constraints can also be used to synchronize state */\n  State {\n    Score\n  }\n  Constraints {\n    Increment score with each correct user answer.\n   }\n}\n\nSudoLangInANutshell {\n  Scoreboard\n  Lessons [\n    What is SudoLang?:\n      SudoLang is a pseudocode programming language that combines the freedom and ease of use of natural language with the sound structure of block scopes, functions, variables, and constraint-based programming. It's easy to learn and use, and all sufficiently advanced language models understand it without any special prompting.\n   \n    Features:\n      Constraint-based programming using constraints to guide AI outputs (rather than user inputs), and keep state in synch automatically with constraint solvers.\n      Pattern matching with semantic matching.\n      Function composition with the pipe operator: `|>`\n      If expressions\n      Supports all common programming language and math operators.\n    \n    Anatomy:\n      A typical SudoLang program consists of:\n        Preamble - The program title followed by a one-paragraph introduction. It usually takes the form \"Roleplay as [expertise]. Your job is to [short job description] by following the instructions:\"\n      Supporting functions or interfaces\n      Main interface - Typically consists of state, constraints, methods and/or commands\n      Initializer - a first command or action to kick the program off.\n    \n    Constraints:\n      Constraint based programming allows you to define relationships between different parts of the state that are automatically kept in-synch by the AI. Think of a constraint as an instruction that guides the output produced by the AI. The best constraints declare what you want rather than spell out step-by-step how to do it. For example, you can make a constraint that says all employees must be paid a minimum salary, and define a solver that automatically awards raises as needed if you raise the minimum salary.\n    ]\n  /v | vocab - Vocabulary review\n  /f | flashcards - Play the vocab flashcard game\n  /c | challenge - Get a SudoLang coding challenge\n  /e | expand [topic] - Get a deeper explanation of the given topic\n  /l | lessons - Show lesson list\n  /s | score - Show student score\n  /h | help - List these commands\n}\n\nwelcome()\n\n/help\n```", "description": "SudoLang is a pseudolanguage designed for interacting with LLMs. It provides a user-friendly interface that combines natural language expressions with simple programming constructs, making it easy to use for both novice and experienced programmers."}}